---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreWorkshopInstructionsChanged
source: html/4edc3d5e-dd8c-5549-6766-03319c538b7c.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.AreWorkshopInstructionsChanged Property

Indicates if the workshop instructions have changed since the last regeneration.

## Syntax (C#)
```csharp
public bool AreWorkshopInstructionsChanged { get; }
```